target/jmeter/testFiles/C4_API_Message_Publishing-Single.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Autobahn Message Publishing" enabled="true">
      <stringProp name="TestPlan.comments">Command line vars are: users=threads; duration=seconds; msgSize=Kb; msgUUID=String; tps=TPS; host=HOST;</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Set Variables" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1475855968000</longProp>
        <longProp name="ThreadGroup.end_time">1475855968000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Get/Gen Request Vars (fltr)" enabled="true">
          <stringProp name="TestPlan.comments">Check args. Get or create a UUID for all messages. Gen text to the required message size in Kb.</stringProp>
          <stringProp name="scriptLanguage">java</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">// get/set defaults
String duration = props.getOrDefault(&quot;duration&quot;, &quot;30&quot;);
props.put(&quot;duration&quot;, duration);
log.info(&quot;duration: &quot; + duration);

String users = props.getOrDefault(&quot;users&quot;, &quot;100&quot;);
props.put(&quot;users&quot;, users);
log.info(&quot;users: &quot; + users);

String myUUID = props.getOrDefault(&quot;myUUID&quot;, UUID.randomUUID().toString());
props.put(&quot;req_uuid&quot;, myUUID);
log.info(&quot;myUUID: &quot; + myUUID);

String ramp = props.getOrDefault(&quot;ramp&quot;, &quot;300&quot;);
props.put(&quot;ramp&quot;, ramp);
log.info(&quot;ramp: &quot; + ramp);

String host = props.getOrDefault(&quot;host&quot;, &quot;messaging-publishing-prf.stg-prsn.com&quot;);
props.put(&quot;host&quot;, host);
log.info(&quot;host: &quot; + host);

String tps = props.getOrDefault(&quot;tps&quot;, &quot;5000&quot;);
props.put(&quot;tps&quot;, tps);
log.info(&quot;tps: &quot; + tps);

String msgSize = props.getOrDefault(&quot;msgSize&quot;, &quot;1&quot;);
//String msgSize = &quot;1&quot;;
props.put(&quot;msgSize&quot;, msgSize);
log.info(&quot;msgSize: &quot; + msgSize);

// convert TPS to TPM
int tpm = Integer.valueOf(tps) * 60;
props.put(&quot;tpm&quot;, Integer.toString(tpm));
log.info(Integer.toString(tpm));

// generate text size
String[] alpha = { &quot;a&quot;, &quot;b&quot;, &quot;c&quot;, &quot;d&quot;, &quot;e&quot;, &quot;f&quot;, &quot;g&quot;, &quot;h&quot;, &quot;i&quot;, &quot;j&quot;, &quot;k&quot;, &quot;l&quot;, &quot;m&quot;, &quot;n&quot;, &quot;o&quot;, &quot;p&quot;, &quot;q&quot;, &quot;r&quot;, &quot;s&quot;, &quot;t&quot;, &quot;u&quot;, &quot;v&quot;, &quot;w&quot;, &quot;x&quot;, &quot;y&quot;, &quot;z&quot; };
int charCount = alpha.length;

int msgSz = Integer.parseInt(msgSize);
int byteSize = msgSz * 1024;
int randStart = new Random().nextInt(charCount);

StringBuilder sb = new StringBuilder(byteSize);

for (int i=0; i &lt; byteSize; i++) {
	int j = (i + randStart) % charCount;
	sb.append(alpha[j]);
}

String message = sb.toString();

props.put(&quot;req_msg&quot;, message);

return myUUID + &quot;\n&quot; + message;</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Get Auth Token" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1475785086000</longProp>
        <longProp name="ThreadGroup.end_time">1475785086000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /tokens (fltr)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;userName&quot;: &quot;autobahn_system&quot;,&#xd;
	&quot;password&quot;: &quot;8gl04H43EfxdaYvllQhUktSrGRxOnjct&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">pqa-piapi-internal.stg-openclass.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/tokens</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Auth Token" enabled="true">
          <stringProp name="JSONPostProcessor.referenceNames">auth_token</stringProp>
          <stringProp name="JSONPostProcessor.jsonPathExprs">data</stringProp>
        </JSONPostProcessor>
        <hashTree/>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Save Auth Token" enabled="true">
          <stringProp name="BeanShellAssertion.query">${__setProperty(auth_token, ${auth_token})}</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Publish Messages" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <longProp name="ThreadGroup.start_time">1473786863000</longProp>
        <longProp name="ThreadGroup.end_time">1473786863000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">30</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <stringProp name="TestPlan.comments">${__P(ramp)} ${__P(users)} ${__P(duration)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Authorization</stringProp>
              <stringProp name="Header.value">${__property(auth_token)}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /messaging/activities" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;originatingSystemCode&quot;:&quot;autobahn-perf-test&quot;,&#xd;
&quot;activities&quot;:[{&#xd;
&quot;messageTypeCode&quot;:&quot;AutoBahn&quot;,&#xd;
&quot;messageVersion&quot;:&quot;1.0&quot;,&#xd;
&quot;namespace&quot;:&quot;autobahn-test&quot;,&#xd;
&quot;payload&quot;:{&#xd;
    &quot;id&quot;:&quot;ASD34&quot;,&#xd;
    &quot;student_id&quot;:100,&#xd;
    &quot;university_id&quot;:98,&#xd;
    &quot;course_details&quot;:{&#xd;
        &quot;course_id&quot;:100,&#xd;
        &quot;enroll_date&quot;:&quot;2012-02-13&quot;,&#xd;
        &quot;status&quot;:&quot;${__property(req_uuid)}|${__counter(false)}|${__time}|${__property(req_msg)}&quot;,&#xd;
        &quot;result_score&quot;:0.9&#xd;
    }&#xd;
}&#xd;
}]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(host)}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/messaging/activities</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Throughput" enabled="true">
            <stringProp name="throughput">${__P(tpm)}</stringProp>
            <intProp name="calcMode">4</intProp>
          </ConstantThroughputTimer>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <boolProp name="ResultCollector.success_only_logging">true</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>